# Отчёт по занятию 2
# Выполнила Трашко М.Д. Вариант 12

# Задание 2.1
# Создание последовательности
p=seq(51,170,4); p
# [1]  51  55  59  63  67  71  75  79  83  87  91
# [12]  95  99 103 107 111 115 119 123 127 131 135
# [23] 139 143 147 151 155 159 163 167
# Повторение последовательности
pl=rep(p,2); pl
# [1]  51  55  59  63  67  71  75  79  83  87  91
# [12]  95  99 103 107 111 115 119 123 127 131 135
# [23] 139 143 147 151 155 159 163 167  51  55  59
# [34]  63  67  71  75  79  83  87  91  95  99 103
# [45] 107 111 115 119 123 127 131 135 139 143 147
# [56] 151 155 159 163 167
# Вектор из слов
c("Tidy","up","your","room!")
# "Tidy"  "up"    "your"  "room!"
