# Задание 2.3.1

pi=c(0.037,	0.091,	0.081,	0.006,	0.081,	0.093,	0.018,	0.081,	0.067,	0.017,	0.001,	0.028,	0.000,	0.051,	0.016,	0.069,	0.044,	0.045,	0.036,	0.085,	0.026,	0.028)
names(pi)<-c("Бодяк полевой", "Хвощ полевой", "Пикульник", "Галинсога", "Звездочка-мокрица", "Осот полевой", "Ежовник куриное просо", "Подмаренник цепкий", "Ромашка непахучая", "Марь белая", "Горец вьюнковый", "Фиалка полевая", "Пастушья сумка", "Подорожник большой", "Пырей ползучий", "Щетинник", "Горец птичий", "Сушеница топяная", "Чистец болотный", "Вьюнок полевой", "Аистник цикутовый", "Щирица запрокинутая")
barplot(pi[pi>0.065],xlab = "Вид растения",ylab= "Доля встречаемости", col="red")

# Задание 2.3.2

x=seq(140,187,0.02)
y=log10(x)
plot(x,y,type = "b", main = "График десятичного логарифма построила Трашко М.", xlab = "X",ylab= "log10(x)", col="blue")