# # Отчёт по занятию 2
# # Выполнила Трашко М.Д. Вариант 12
# 
# # Задание 2.1
# 
# # Создание последовательности 
# p=seq(51,170,4); p 
# # [1]  51  55  59  63  67  71  75  79  83  87  91
# # [12]  95  99 103 107 111 115 119 123 127 131 135
# # [23] 139 143 147 151 155 159 163 167
# 
# # Повторение последовательности 
# pl=rep(p,2); pl 
# # [1]  51  55  59  63  67  71  75  79  83  87  91
# # [12]  95  99 103 107 111 115 119 123 127 131 135
# # [23] 139 143 147 151 155 159 163 167  51  55  59
# # [34]  63  67  71  75  79  83  87  91  95  99 103
# # [45] 107 111 115 119 123 127 131 135 139 143 147
# # [56] 151 155 159 163 167
# 
# # Вектор из слов 
# c("Tidy","up","your","room!") 
# # "Tidy"  "up"    "your"  "room!"
# 
# # Задание 2.2
# 
# x= c(2, 3,7,9,14, 16,19, 18, 23, 35)
# 
# # Выбор пятого значения 
# x[5] 
# # [1] 14
# 
# # Выбор 2-7-го значений в векторе x 
# x[2:7] 
# # [1]  3  7  9 14 16 19
# 
# # Выбор 3-го и 7-го значений в векторе x 
# x[c(3,7)] 
# # [1]  7 19
# 
# # Выбор значений вектора x без 1-ой точки 
# x[-1] 
# # [1]  3  7  9 14 16 19 18 23 35
# 
# # Выбор значений вектора x без 1-го - 3-го значений 
# x[-(1:3)] 
# # [1]  9 14 16 19 18 23 35
# 
# # Выбор значений вектора x больше 8 
# x[x>8] 
# # [1]  9 14 16 19 18 23 35
# 
# # Выбор значений вектора x, удовлетворяющие условию: x больше
# # 14 и меньше 20 
# x[x>14&x<20] 
# # [1] 16 19 18
# 
# # Задание 2.3.1
# 
# pi=c(0.037,	0.091,	0.081,	0.006,	0.081,	0.093,	0.018,	0.081,	0.067,	0.017,	0.001,	0.028,	0.000,	0.051,	0.016,	0.069,	0.044,	0.045,	0.036,	0.085,	0.026,	0.028)
# names(pi)<-c("Бодяк полевой", "Хвощ полевой", "Пикульник", "Галинсога", "Звездочка-мокрица", "Осот полевой", "Ежовник куриное просо", "Подмаренник цепкий", "Ромашка непахучая", "Марь белая", "Горец вьюнковый", "Фиалка полевая", "Пастушья сумка", "Подорожник большой", "Пырей ползучий", "Щетинник", "Горец птичий", "Сушеница топяная", "Чистец болотный", "Вьюнок полевой", "Аистник цикутовый", "Щирица запрокинутая")
# barplot(pi[pi>0.065],xlab = "Вид растения",ylab= "Доля встречаемости", col="red")
# 
# # Задание 2.3.2
# 
# x1=seq(140,187,0.02)
# y=log10(x)
# plot(x1,y,type = "b", main = "График десятичного логарифма построила Трашко М.", xlab = "X",ylab= "log10(x)", col="blue")
# 
# # Задание 2.4
# 
# novob12=read.table("Trashko.csv",header = TRUE, sep = ";",dec = ".")
# dim(novob12)
# summary(novob12)
# novob12$Pole
# novob12$Humus
# novob12$K2O
# novob12$A1
# names(novob12)
# plot(novob12$Humus,novob12$K2O)
# write.table (novob12, "novob.csv", sep = ";", dec = ",", quote=FALSE)

# Задание 2.5

W12=read.table("Tras12.csv",header = TRUE, sep = ";",dec = ",")

dim(W12)
summary(W12)
names(W12)

#Mw-вес влаги
Mw=W12$Mbsw-W12$Mbs
#Ms-вес сухой почвы
Ms=W12$Mbs-W12$Mb
# Moisture-влажность
Moisture=100*Mw/Ms
Moisture
write.table (Moisture, "Moist12.csv", sep = ";", dec = ",", quote=FALSE)
